posts/20230918-open-not-enough.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>./greg.out - Open Source is not enough</title>
<meta name="author" content="Greg Silverstein" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/me/css/style.css">
<link rel="alternate" type="application/rss+xml" title="./greg.out" href="/me/index.xml">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="preamble" class="status">
<header class="site-header"><div class="wrap"><div class="brand"><a class="logo" href="/me/">./greg.out</a><div class="subtitle">Greg Silverstein's Home on the internet</div></div><nav><a href="/me/">Home</a><a href="/me/about.html">About</a><a href="/me/resume.html">Resume</a><a href="/me/index.xml">RSS</a><a href="https://github.com/gsilvers">GitHub</a></nav></div></header><div class="wrap page-head"><h1 class="page-title">Open Source is not enough</h1><div class="page-meta">2023-09-18</div></div>
</div>
<div id="content" class="content">
<section id="outline-container-the-internet-is-becoming-enshittified" class="outline-2">
<h2 id="the-internet-is-becoming-enshittified">The internet is becoming enshittified</h2>
<div class="outline-text-2" id="text-the-internet-is-becoming-enshittified">
<p>
I've been giving a lot of thought in the past year or so to what I see as one of the many troubles of our time. Having the ever growing mass of humanity that spends its time online, completely un-educated about being on a computer.
</p>

<p>
<i>You know aside from the germs, global warming, endless wars and our continued tendency to crap all over anyone non-white cis male?</i>
</p>

<p>
Over the years I've heard countless anecdotes such as <a href="https://en.wikipedia.org/wiki/Eternal_September">Eternal September</a> bemoaning the constant flux of new and uneducated internet citizens. I've also seen professionally the issues caused by our less than perfect system for educating people on computers. The constant take away of this is that the "masses" are causing <a href="https://en.wiktionary.org/wiki/enshittification">enshittification</a> and its all their fault.
</p>

<p>
Except mostly its ours and all we want to do is make excuses. We have great tools, we have open source, we have&#x2026; X formerly known as twitter?
</p>
</div>
</section>
<section id="outline-container-open-source-is-not-enough" class="outline-2">
<h2 id="open-source-is-not-enough">Open source is not enough</h2>
<div class="outline-text-2" id="text-open-source-is-not-enough">
<p>
Shit
</p>

<p>
It's simply not. I remember my first foray into open computing. I started poking around IRC on a computer that was using AOL dial up. My brain exploded, the idea of people just sharing information and in my case at the time music blew my mind. I spent hours reading help files and honestly the curiosity to explore hidden rooms never left. I'll probably die getting stuck trying to find my way into some new secret library.
</p>

<p>
People don't read things just because they exist. They don't learn math just because a book titled Math is in their backpack. Open source is a great ethos but its just one step in the game. We need to do better than just making things available. We need to share and encourage people to open the door.
</p>

<p>
When you read a book story what encourages the the eager to adventure? Do Merry and Pippin head off to far lands on the premise of someone calling them a <a href="https://github.com/corollari/linusrants">fucking idiot</a>? Do they go just because Gondor exists? Of course not they follow the kind urging of Gandalf and the company of friends they trust. They go and despite learning the pain of war they help save their little world.
</p>

<p>
Why are we then shocked that people flock to the internet to argue, fight and shit absolutely everywhere? We hand them a phone made by Sundar Pichai or Tim Cook generally designed to suck money from them any way possible. Even if that means they melt the planet and literally scream at <a href="https://www.insider.com/girl-left-sobbing-man-accused-her-of-being-trans-athletics-2023-6">transgender children</a>. We have tools and books available to them hidden off in the far reaches of the ether with no sign posts or maps. We complain that people do not understand the basics of <a href="https://en.wikipedia.org/wiki/Golden_Rule">kindness</a>. We complain that newer developers just churn out "CRUD apps in react" and yet no one sits down with them for three months and goes through <a href="https://web.mit.edu/6.001/6.037/sicp.pdf">the wizard book</a>.
</p>

<p>
The adventure isn't there if we do not put people on the path to it.
</p>
</div>
</section>
<section id="outline-container-putting-people-on-a-path" class="outline-2">
<h2 id="putting-people-on-a-path">Putting people on a path</h2>
<div class="outline-text-2" id="text-putting-people-on-a-path">
<p>
We cannot simply wish or force people into better online discourse and understanding of the world we've created in the past 20 years. We need to put them on the course for adventure rather than milking them for money and then complaining they behave as a cow would.
</p>

<p>
I'm writing this post from a steam deck. Why? Because it asked me to try it. When young people are handed an iPad, when does it ever direct them to what lies underneath? Swift playgrounds? Barf. When does it suggest they do anything other than what sells? The steam deck has the wonderful gem of switch to desktop mode. Konsole is there. It probably makes Valve zero extra money. It asks you to come check out what lies beneath and within 2 hours of playing games on mine I was seeing if I could install Hugo and touch my deserted blog.
</p>

<p>
This is the type of thing we need to build more and more of. Valve seems to get it, how can we have them teach Apple or Microsoft? Can we or is the profit motive too much? Why doesn't the xbox or iPad or iPhone encourage users into developer mode?
</p>

<p>
More importantly what can you and I do each day to help with this? How do we redirect people to better ways?
</p>

<p>
I'm genuinely asking. Its on my mind and I absolutely have no complete answers. I'd love to <a href="https://hachyderm.io/@pokeypoke">speak about it with anyone</a> and if we have a good idea who knows do something actually about the mess together.
</p>

<p>
Later!
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><div class="wrap">Written by Greg Silverstein &middot; theme <a href="https://github.com/protesilaos/ef-themes">ef-cherie</a> &middot; built with org-publish in GNU Emacs</div></footer>
</div>
</body>
</html>
